In [1]:
import pandas as pd

sandw= pd.Series([2,52,41,30,81,12,0], index=['mon','tue','wed','thu','fri','sat','sun'],name='Weekly Sales')
sandw

mon     2
tue    52
wed    41
thu    30
fri    81
sat    12
sun     0
Name: Weekly Sales, dtype: int64

In [9]:
print(sandw[1])
print(sandw['tue'])
display('======')
print(sandw[['mon','wed']])
display('======')
print(sandw[sandw > 20])

52
52

'======'

mon     2
wed    41
Name: Weekly Sales, dtype: int64

'======'

tue    52
wed    41
thu    30
fri    81
Name: Weekly Sales, dtype: int64

In [12]:
display(sandw*2)
print(sandw)

'wed' in sandw

mon      4
tue    104
wed     82
thu     60
fri    162
sat     24
sun      0
Name: Weekly Sales, dtype: int64

mon     2
tue    52
wed    41
thu    30
fri    81
sat    12
sun     0
Name: Weekly Sales, dtype: int64

True

In [14]:
import numpy as np
set1=np.array([2,5,7,13,14,32,1,64])
set2=np.array(['set1','set2','set3','set4','set5','set6','set7','set8'])
series=pd.Series(set1,index=set2)
series

set1     2
set2     5
set3     7
set4    13
set5    14
set6    32
set7     1
set8    64
dtype: int32

In [16]:
dic={'Karachi':500,'Hyderabad':100,'Lahore':160,'Islamabad':60}
city_revenue=pd.Series(dic)
print(city_revenue)
city_revenue.values

Karachi      500
Hyderabad    100
Lahore       160
Islamabad     60
dtype: int64

array([500, 100, 160,  60], dtype=int64)

**Series can be use with numpy array**

*It can also use with list or dictionary

# null value

In [30]:
dic={'Karachi':500,'Hyderabad':100,'Lahore':160,'Islamabad':60}
sets=pd.Series(dic,index=['Karachi','Lahore','Rawalpindi'])
display(sets)
pd.isnull(sets)
sets.isnull()
sets.index.name="Face"
display(sets.index)
sets.name="Faces"
display(sets)

Karachi       500.0
Lahore        160.0
Rawalpindi      NaN
dtype: float64

Index(['Karachi', 'Lahore', 'Rawalpindi'], dtype='object', name='Face')

Face
Karachi       500.0
Lahore        160.0
Rawalpindi      NaN
Name: Faces, dtype: float64

In [33]:
shop=pd.Series(['600.rs','1600.rs','6100.rs','12000.rs'], index=['Skirt','2 Piece Suit','Pent and Cort','Hot piece suit'], name='My Shop')
display(shop)
shop.index=['Suit 1','Suit 2','Suit 3','Suit 4']
display(shop)

Skirt               600.rs
2 Piece Suit       1600.rs
Pent and Cort      6100.rs
Hot piece suit    12000.rs
Name: My Shop, dtype: object

Suit 1      600.rs
Suit 2     1600.rs
Suit 3     6100.rs
Suit 4    12000.rs
Name: My Shop, dtype: object

# Add Series to Frame

In [41]:
s1=pd.Series([70,50,110,60],index=['Karachi','Lahore','Khairpur','Kashmir'], name='Orange')
s2=pd.Series([100,80,130,50],index=['Karachi','Lahore','Khairpur','Kashmir'],name='Apple')
fruit=[s1,s2]
display(pd.DataFrame(fruit))
sets={'State':['Sindh','Punjab','Balochistan','KPK','Kashmir'],
      'GDP' :[3.9,5.4,4.6,6.1,4.1],
      'No of People' :['40 Million','55 Million','31 Million','25 Million','17 Million']}
display(pd.DataFrame(sets))
display(pd.DataFrame(sets,index=['ID 1','ID 2','ID 3','ID 4','ID 5']))

        Karachi  Lahore  Khairpur  Kashmir
Orange       70      50       110       60
Apple       100      80       130       50

         State  GDP No of People
0        Sindh  3.9   40 Million
1       Punjab  5.4   55 Million
2  Balochistan  4.6   31 Million
3          KPK  6.1   25 Million
4      Kashmir  4.1   17 Million

            State  GDP No of People
ID 1        Sindh  3.9   40 Million
ID 2       Punjab  5.4   55 Million
ID 3  Balochistan  4.6   31 Million
ID 4          KPK  6.1   25 Million
ID 5      Kashmir  4.1   17 Million

In [45]:
p=pd.DataFrame(sets,columns=['No of People','GDP'])
p

  No of People  GDP
0   40 Million  3.9
1   55 Million  5.4
2   31 Million  4.6
3   25 Million  6.1
4   17 Million  4.1

In [46]:
p.index.name='S.no'

In [47]:
p

     No of People  GDP
S.no
0      40 Million  3.9
1      55 Million  5.4
2      31 Million  4.6
3      25 Million  6.1
4      17 Million  4.1

In [53]:
tab = pd.DataFrame(sets,index=['ID 1','ID 2','ID 3','ID 4','ID 5'],columns=['No of People','State','GDP','Rating'])
display(tab['GDP'])
display(tab.GDP )

ID 1    3.9
ID 2    5.4
ID 3    4.6
ID 4    6.1
ID 5    4.1
Name: GDP, dtype: float64

ID 1    3.9
ID 2    5.4
ID 3    4.6
ID 4    6.1
ID 5    4.1
Name: GDP, dtype: float64

In [54]:
tab.loc['ID 1']

No of People    40 Million
State                Sindh
GDP                    3.9
Rating                 NaN
Name: ID 1, dtype: object

#Filling Dataframe null values

In [2]:
import numpy as np
display(tab)
new_val= np.arange(len(tab))
tab.Rating=new_val
display(tab)

NameError: name 'tab' is not defined

In [60]:
tab.Rating=pd.Series([1.5,6,8.4,4,9.1],index=['ID 1','ID 2','ID 3','ID 4','ID 5'])

In [61]:
tab

     No of People        State  GDP  Rating
ID 1   40 Million        Sindh  3.9     1.5
ID 2   55 Million       Punjab  5.4     6.0
ID 3   31 Million  Balochistan  4.6     8.4
ID 4   25 Million          KPK  6.1     4.0
ID 5   17 Million      Kashmir  4.1     9.1

# Function Application and Mapping

In [7]:
import numpy as np
table=pd.DataFrame(np.random.randn(4,3), columns=list('tre'),index=['1st','2nd','3rd','4th',])
print(table['r'].min())
print(table['r'].min()-table['t'].max())

f= lambda x: x.max()-x.min()
n=table.apply(f)
print(n,type(n))
display('---')
n=table.apply(f,axis=1)
print(n)

-0.9320581723210793
-1.321084585573606
t    1.811648
r    2.603126
e    0.770605
dtype: float64 <class 'pandas.core.series.Series'>

'---'

1st    2.518618
2nd    1.532121
3rd    0.664425
4th    1.519288
dtype: float64

In [29]:
def min_max(x):
    
    return pd.Series( [x.min(),x.max()], index=['min','max'] )
n=table.apply(min_max)
print(n,type(n))

NameError: name 'table' is not defined

# Sorting indexing

In [36]:
set1=pd.DataFrame(np.arange(16).reshape(4,4), index=['two','four','one','three'], columns=list('cdab'))
display(set1)
display(set1.sort_index(axis=1, ascending=False))
display(set1.sort_index(axis=0, ascending=False))

        c   d   a   b
two     0   1   2   3
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15

        d   c   b   a
two     1   0   3   2
four    5   4   7   6
one     9   8  11  10
three  13  12  15  14

        c   d   a   b
two     0   1   2   3
three  12  13  14  15
one     8   9  10  11
four    4   5   6   7

In [42]:
display(set1.sort_values(by='d'))
print(set1.rank(ascending=False, method='max'))
print(set1.rank(ascending=True, method='min'))
print(set1.rank(axis='columns'))

        c   d   a   b
two     0   1   2   3
four    4   5   6   7
one     8   9  10  11
three  12  13  14  15

         c    d    a    b
two    4.0  4.0  4.0  4.0
four   3.0  3.0  3.0  3.0
one    2.0  2.0  2.0  2.0
three  1.0  1.0  1.0  1.0
         c    d    a    b
two    1.0  1.0  1.0  1.0
four   2.0  2.0  2.0  2.0
one    3.0  3.0  3.0  3.0
three  4.0  4.0  4.0  4.0
         c    d    a    b
two    1.0  2.0  3.0  4.0
four   1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0
three  1.0  2.0  3.0  4.0

In [49]:
display(set1.sum())
display(set1.sum(axis='columns'))

display(set1.mean(axis='columns',skipna=False))

c    24
d    28
a    32
b    36
dtype: int64

two       6
four     22
one      38
three    54
dtype: int64

two       1.5
four      5.5
one       9.5
three    13.5
dtype: float64

In [62]:
print(set1['b'].unique())
print(set1['b'].value_counts())

[ 3  7 11 15]
7     1
3     1
11    1
15    1
Name: b, dtype: int64

# Fill null values

In [9]:
import numpy as np
set1=pd.DataFrame(range(3),index=[0,3,5])
display(set1.reindex(range(7),method='ffill'))
display(set1.reindex(range(7)))

   0
0  0
1  0
2  0
3  1
4  1
5  2
6  2

     0
0  0.0
1  NaN
2  NaN
3  1.0
4  NaN
5  2.0
6  NaN

In [20]:
set1=pd.DataFrame(np.arange(12).reshape(4,3),columns=['Apple','Mango','Orange'])
display(set1)
display(set1.reindex(columns=['Apple','Mango','Tomato','Orange'],method='ffill'))

   Apple  Mango  Orange
0      0      1       2
1      3      4       5
2      6      7       8
3      9     10      11

   Apple  Mango  Tomato  Orange
0      0      1       2       2
1      3      4       5       5
2      6      7       8       8
3      9     10      11      11

In [16]:
revenue=pd.DataFrame(np.arange(16).reshape(4,4), index=list('jali'),columns=list('sali') )
#revenue.loc[['j','i'],['a','i']]
display(revenue)
revenue.iloc[2,[1,3,2]]

    s   a   l   i
j   0   1   2   3
a   4   5   6   7
l   8   9  10  11
i  12  13  14  15

a     9
i    11
l    10
Name: l, dtype: int32

# Arithmetic and Data Alignment

In [8]:
set1=pd.DataFrame(np.arange(16).reshape(4,4),columns=list('abcf'))
set2=pd.DataFrame(np.arange(12).reshape(3,4) ,index=[0,1,2],columns=list('atcf'))
set3=set1+set2
display(set3)

      a   b     c     f   t
0   0.0 NaN   4.0   6.0 NaN
1   8.0 NaN  12.0  14.0 NaN
2  16.0 NaN  20.0  22.0 NaN
3   NaN NaN   NaN   NaN NaN

In [5]:
set3=set1.add(set2,fill_value=0)
set3

      a     b     c     f    t
0   0.0   1.0   4.0   6.0  1.0
1   8.0   5.0  12.0  14.0  5.0
2  16.0   9.0  20.0  22.0  9.0
3  12.0  13.0  14.0  15.0  NaN

In [18]:
set1=pd.DataFrame(np.arange(16).reshape(4,4),index=[1,2,3,4],columns=list('abcf'))
series=pd.Series(np.arange(4),index=list('abcf'))
display(series.index,series.values)
print(set1-series)

Index(['a', 'b', 'c', 'f'], dtype='object')

array([0, 1, 2, 3])

    a   b   c   f
1   0   0   0   0
2   4   4   4   4
3   8   8   8   8
4  12  12  12  12

# Deleting data from row and columns

In [28]:
display(set1)
display(set1.drop('b',axis=1))
set1.drop(2,axis=0,inplace=True)
set1

    b   f
1   1   3
2   5   7
3   9  11
4  13  15

    f
1   3
2   7
3  11
4  15

    b   f
1   1   3
3   9  11
4  13  15

# Indexes Selection and Filtering

# Data Loading, Storage and file format.

In [2]:
import pandas as pd
sample1=pd.read_csv('examples/sample.csv')
sample1

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [5]:
sample1=pd.read_csv('examples/sample.csv', skiprows=1 ,names=['id','name','ch','ph','en','ma'])
sample1

    id         name  ch  ph  en  ma
0  A01     arif ali  20  30  40  50
1  A02  kamran khan  30  40  50  60
2  A03   imran ali   40  50  60  70
3  A04  kashif khan  50  60  70  80

In [14]:
sample=pd.read_csv('examples/sample2.csv')
display(sample.head())
sample=pd.read_csv('examples/sample2.csv', index_col=['key1','key2'])
display(sample.head())

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10

In [22]:
sample=pd.read_csv('examples/sample3.csv')
display(sample)
sample=pd.read_csv('examples/sample3.csv',na_values=['NULL'])
display(sample)
sample=pd.read_csv('examples/sample3.csv',na_values={'message':['foo','NA']})
display(sample)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [24]:
sample=pd.read_csv('dataset/train.csv',nrows=100)
sample.tail()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
95,1137,1,1.0,0,18,0,7,1.0,196,3,...,942,1179,3616,13,5,12,1,1,1,3
96,1355,0,2.3,0,10,1,23,0.2,132,5,...,651,891,880,19,4,8,1,1,0,0
97,1665,1,0.5,0,3,1,60,0.2,194,6,...,1572,1684,1601,18,17,14,1,0,0,2
98,657,0,2.5,0,0,0,37,0.7,141,2,...,476,961,1412,14,3,18,0,1,0,0
99,593,0,0.5,0,6,0,31,0.4,156,7,...,1233,1317,1692,6,2,7,1,0,0,1

In [40]:
sample=pd.read_csv('dataset/train.csv',chunksize=500)
lst=[]
for sets in sample:
    print(len(sets),sets.shape)
    lst.append(sets)
display(lst[0].head())
display(lst[1].head())

500 (500, 21)
500 (500, 21)
500 (500, 21)
500 (500, 21)

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
500,1278,1,0.5,1,1,0,54,0.1,104,8,...,581,750,1155,7,1,20,0,0,1,0
501,1773,1,2.5,0,16,1,32,0.6,170,6,...,1215,1472,3566,17,6,13,1,0,1,3
502,1661,1,0.8,1,1,1,6,1.0,109,7,...,594,1337,864,9,8,2,1,0,1,1
503,1438,0,2.2,0,0,1,32,0.6,176,7,...,683,1663,869,19,13,9,1,1,1,0
504,1661,1,1.4,0,0,0,29,0.3,119,2,...,536,861,591,9,2,9,1,1,1,0

In [43]:
list(open('examples/ex3.txt'))
result = pd.read_table('examples/ex3.txt', sep='\s+')#use when file contains seperate by lots of spaces 
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [45]:
df=pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Write Data to Text Format

In [5]:
import numpy as np
set1=pd.DataFrame(np.arange(16).reshape(4,4))
set1
set1.to_csv('examples/out.csv')

In [10]:
set2=pd.date_range('1/1/2001',periods=7)
print(set2)
dates=pd.Series(np.arange(7),index=set2)
dates.values

DatetimeIndex(['2001-01-01', '2001-01-02', '2001-01-03', '2001-01-04',
               '2001-01-05', '2001-01-06', '2001-01-07'],
              dtype='datetime64[ns]', freq='D')

array([0, 1, 2, 3, 4, 5, 6])

# Working with Delimited Formats

In [11]:
import csv
f= open('examples/ex7.csv')
reader = csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

# JSON Data  Short for JavaScript Object Notation

In [13]:
setj=pd.read_json('examples/example.json')
setj

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

# XML and HTML: Web data loading into  dataframe

In [11]:
import pandas as pd
tables= pd.read_html('examples/fdic_failed_bank_list.html')
#read_html converts any table to comma seperated data
#if file has multiple tables it defines by tables[1],[2]...
print(len(tables))
set_table=tables[0]
print(set_table.shape)
print(set_table.columns)
display(set_table['City'].head())
display(set_table.head())

1
(547, 7)
Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

0           Mulberry
1           Woodbury
2    King of Prussia
3            Memphis
4          Milwaukee
Name: City, dtype: object

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [14]:
dateandtime=pd.to_datetime(set_table['Closing Date'])
print(type(dateandtime),dateandtime)

<class 'pandas.core.series.Series'> 0     2016-09-23
1     2016-08-19
2     2016-05-06
3     2016-04-29
4     2016-03-11
         ...
542   2001-07-27
543   2001-05-03
544   2001-02-02
545   2000-12-14
546   2000-10-13
Name: Closing Date, Length: 547, dtype: datetime64[ns]

# Binary Data Formats

In [15]:
frame=pd.read_csv('examples/ex1.csv')
frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
import numpy as np
frame= pd.DataFrame({'a': np.random.randn(100)})
store=pd.HDFStore('mydata.h5')
store['obj1']=frame
store['obj1_col']= frame['a']
print(store)
x=store.obj1
print(type(x))
print(x.head())
print('-------')
store.put('obj2',frame,format='table')
store.select('obj2',where=['index>=10 and index <=15'])
store.close()
frame.to_hdf('mydata.h5','obj3', format='table')

frame=pd.read_hdf('mydata.h5','obj3',where=['index < 5'])

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

<class 'pandas.core.frame.DataFrame'>
          a
0  1.765717
1 -0.470100
2  0.789951
3 -1.283745
4 -1.818207
-------

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).